let buttons = document.querySelectorAll('.img-filters__button');

buttons.forEach((button) => {

  button.addEventListener('click', () => {



  });

});



// функция сортировки по колву комментариев
// функция "сортировки" возврщающая 10 случайных

// по клику на одну кнопку должна взвываться функция отрисовки картинкок. в функцию передаем доп. аргумент фильтра () => {отрисовка(знач. фильтра)}

// внутри функции отрисовки картинок мы копируем массив, сортируем массив одними из способов (способ передаем аргументом).


